tests_jmeter/results/statistics.json
{
  "EliminarJuegosSeleccionados" : {
    "transaction" : "EliminarJuegosSeleccionados",
    "sampleCount" : 100,
    "errorCount" : 14,
    "errorPct" : 14.0,
    "meanResTime" : 1.7200000000000002,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 10.114291493880854,
    "receivedKBytesPerSec" : 2.874276196014969,
    "sentKBytesPerSec" : 1.886552417315667
  },
  "VerJuegosSeleccionados" : {
    "transaction" : "VerJuegosSeleccionados",
    "sampleCount" : 100,
    "errorCount" : 43,
    "errorPct" : 43.0,
    "meanResTime" : 1.47,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.9499999999999886,
    "pct3ResTime" : 3.0,
    "throughput" : 10.11326860841424,
    "receivedKBytesPerSec" : 2.6369557797330097,
    "sentKBytesPerSec" : 1.6690843699433657
  },
  "VerVentaNuevos" : {
    "transaction" : "VerVentaNuevos",
    "sampleCount" : 100,
    "errorCount" : 80,
    "errorPct" : 80.0,
    "meanResTime" : 2.169999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0,
    "throughput" : 10.097950116126427,
    "receivedKBytesPerSec" : 43.88269337574472,
    "sentKBytesPerSec" : 1.5876659850550336
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000,
    "errorCount" : 529,
    "errorPct" : 52.9,
    "meanResTime" : 2.438000000000004,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 70.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 10.0,
    "throughput" : 100.44194455604661,
    "receivedKBytesPerSec" : 118.86284024708719,
    "sentKBytesPerSec" : 18.371851772800323
  },
  "VerEstados" : {
    "transaction" : "VerEstados",
    "sampleCount" : 100,
    "errorCount" : 47,
    "errorPct" : 47.0,
    "meanResTime" : 1.5700000000000005,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.97999999999999,
    "throughput" : 10.094891984655765,
    "receivedKBytesPerSec" : 3.292669846557642,
    "sentKBytesPerSec" : 1.5378937007874014
  },
  "VerCategorias" : {
    "transaction" : "VerCategorias",
    "sampleCount" : 100,
    "errorCount" : 40,
    "errorPct" : 40.0,
    "meanResTime" : 1.4399999999999997,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 10.116337885685383,
    "receivedKBytesPerSec" : 5.3249083206879115,
    "sentKBytesPerSec" : 1.5707985584218513
  },
  "VerVentaUsados" : {
    "transaction" : "VerVentaUsados",
    "sampleCount" : 100,
    "errorCount" : 81,
    "errorPct" : 81.0,
    "meanResTime" : 2.2899999999999996,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 10.949999999999974,
    "throughput" : 10.102030508132135,
    "receivedKBytesPerSec" : 46.73175636427922,
    "sentKBytesPerSec" : 1.588307531063744
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 100,
    "errorCount" : 22,
    "errorPct" : 22.0,
    "meanResTime" : 2.92,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 7.0,
    "throughput" : 10.090817356205854,
    "receivedKBytesPerSec" : 2.828188067608476,
    "sentKBytesPerSec" : 2.315763748738648
  },
  "VerDetalleProducto" : {
    "transaction" : "VerDetalleProducto",
    "sampleCount" : 100,
    "errorCount" : 51,
    "errorPct" : 51.0,
    "meanResTime" : 1.6900000000000008,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.989999999999995,
    "throughput" : 10.093873019077419,
    "receivedKBytesPerSec" : 5.796091147673362,
    "sentKBytesPerSec" : 1.6461687443221964
  },
  "VerJuegoDetalle" : {
    "transaction" : "VerJuegoDetalle",
    "sampleCount" : 100,
    "errorCount" : 51,
    "errorPct" : 51.0,
    "meanResTime" : 1.6500000000000004,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 6.97999999999999,
    "throughput" : 10.111223458038422,
    "receivedKBytesPerSec" : 3.0807633973710815,
    "sentKBytesPerSec" : 1.619375631951466
  },
  "Registrarse" : {
    "transaction" : "Registrarse",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 7.460000000000001,
    "medianResTime" : 6.0,
    "minResTime" : 4.0,
    "maxResTime" : 70.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 11.949999999999989,
    "pct3ResTime" : 69.55999999999977,
    "throughput" : 10.063399416322834,
    "receivedKBytesPerSec" : 3.0760195481533663,
    "sentKBytesPerSec" : 3.046536932675858
  }
}